'use strict';

let questions = [
    {
        text: 'Столица Российской федерации',
        variants: {
            'a': 'Москва',
            'b': 'Вашигтон',
            'c': 'Санкт-Петербург',
            'd': 'Токио',
        },
        correctAnswerIndex: 'a',
    },
    {
        text: 'Заболевание опорно-двигательного аппарата',
        variants: {
            'a': 'Астигматизм',
            'b': 'Атеизм',
            'c': 'Ревматизм',
            'd': 'Астигматизм',
        },
        correctAnswerIndex: 'c',
    },
    {
        text: 'Основной язык ашкеназов',
        variants: {
            'a': 'Абра-Кадабра',
            'b': 'Инглиш',
            'c': 'Шведиш',
            'd': 'Идиш',
        },
        correctAnswerIndex: 'd',
    },
    {
        text: 'Зрелище с участием "Русских витязей"',
        variants: {
            'a': 'Стенка на стенку',
            'b': 'Авиашоу',
            'c': 'Ледовое побоище',
            'd': 'Пьянка',
        },
        correctAnswerIndex: 'b',
    },
    {
        text: 'Народный сход у славян',
        variants: {
            'a': 'Вече',
            'b': 'Государственная дума',
            'c': 'Классное собрание',
            'd': 'Митинг',
        },
        correctAnswerIndex: 'a',
    },
];